docs/2026-10-08.md
```mermaid
classDiagram
    class Asset {
        <<abstract>>
        + name: String
        + color: String
        + price: Int
    }

    class TangibleAsset {
        <<abstract>>
        + TangibleAsset(name: String, color: String, price: Int, weight: Double)
    }

    class Thing {
        <<interface>>
        + MIN_WEIGHT: Double$
        + MAX_WEIGHT: Double$

        + weight: Double
    }

    class AuthState {
        <<enumeration>>
        AUTHENTICATED
        UNAUTHENTICATED
        UNKNOWN
    }

    class KeyType {
        <<enumeration>>
        PADLOCK
        BUTTON
        DIAL
        FINGER

        + limit: Int
    }

    class Book {
        + isbn: String

        + Book(isbn: String, name: String, color: String, price: Int, weight: Double)
    }

    class Pocket~E~ {
        - _data: E?

        + put(data: E)
        + get() E?
    }

    class StrongBox~T~ {
        - data: T?
        + count: Int

        + put(data: T?)
        + get() T?
    }

    class Word {
        + word: String
        + letter(Int) String
        - vowel: Set~String~

        + isVowel(i: Int) Boolean
        + isConsonant(i: Int) Boolean
        - validateWord(word: String)
    }

    %% Relationships
    Asset <|-- TangibleAsset
    Thing <|.. TangibleAsset
    TangibleAsset <|-- Book

    StrongBox ..> KeyType
```
